# MepSystemFillGraphicsOverridesParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepSystemFillGraphicsOverridesParam Property
ParameterTypeId Class See Also
---
"Fill Pattern Graphics Overrides"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepSystemFillGraphicsOverridesParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepSystemFillGraphicsOverridesParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepSystemFillGraphicsOverridesParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace